{
  "backend/main.mo": "Motoko canister defining user profiles and a Moments photo collection with access control, storing photo metadata per user and integrating blob storage and authorization mixins.",
  "feature_evidence.json": "Machine-readable report documenting a UI feature change to planned-moment pill card styling, including affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend files describing routing, pages, components, styling changes, and authentication behavior.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions implementing the design system, dark mode, and base styles used across the frontend.",
  "frontend/index.html": "HTML entry point configuring viewport behavior, preloading splash media assets, loading Font Awesome, and mounting the React app.",
  "frontend/src/App.tsx": "Main React application file configuring TanStack Router routes for all pages including splash, home, camera, calendar, vault, profile, and settings.",
  "frontend/src/components/ConfirmDeleteModal.tsx": "Reusable confirmation modal component for destructive actions, rendering a backdrop, title, message, and cancel/delete buttons.",
  "frontend/src/components/HamburgerMenu.tsx": "Placeholder or empty file intended for the hamburger menu component implementation.",
  "frontend/src/components/HomeWeeklyCalendarStrip.tsx": "Interactive weekly calendar strip component allowing week navigation, date selection, and visual indicators for dates with planned moments.",
  "frontend/src/components/InlineToast.tsx": "Lightweight toast notification component with timed auto-dismiss, fade/slide animations, and configurable placement.",
  "frontend/src/components/MomentsImageCard.tsx": "Renders a styled card displaying a moment photo with header metadata (avatar, name, location, timestamp), the main image, and optional private details like who, reflection, and feeling emoji.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "Implements an animated bottom-sheet UI for creating a planned moment, handling date/time input, auto color assignment, save/cancel logic, and visibility transitions.",
  "frontend/src/components/PlannedMomentCard.tsx": "Displays a compact card for a planned moment showing date, optional title, time, color indicator, and action buttons for share and delete.",
  "frontend/src/components/SignInOverlay.tsx": "Empty or placeholder file with no implementation provided.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Hook that automatically requests browser geolocation once per session when enabled and returns coordinates via a success callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useInView.ts": "IntersectionObserver-based hook that reports whether a referenced element is in view, with configurable threshold, margins, and one-time triggering.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Loads and tracks moment photos from local storage, exposing all photos and the most recent one while reacting to storage and custom update events.",
  "frontend/src/hooks/usePlannedMoments.ts": "Manages planned moments stored locally, exposing moments by date, all moments, date metadata, and helpers to add or delete moments with live refresh.",
  "frontend/src/hooks/useProfile.ts": "Hook for loading and updating the user profile from local storage, with automatic geolocation lookup when location data is missing.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module reserved for future React Query hooks; currently exports nothing because no backend queries are needed yet.",
  "frontend/src/index.css": "Global Tailwind and CSS styles defining fonts, light/dark theme variables using OKLCH, base element styling, and extensive custom UI styles for glass cards, home calendar, and other components.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/CalendarPage.tsx": "Implements a weekly calendar view with date navigation, selection, and indicators for photo and planned moments, integrating planned moments data and a bottom sheet UI.",
  "frontend/src/pages/CameraScreen.tsx": "Mobile-focused camera capture screen that uses a custom camera hook to take or upload photos, save them as drafts, and navigate through the capture flow.",
  "frontend/src/pages/HomeScreen.tsx": "Main home screen showing the weekly calendar strip and planned moments, handling navigation, sharing, deletion, and bottom-sheet planning interactions.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Animated multi-card mobile splash/onboarding screen with autoplay media and Internet Identity login flow, handling transitions and initial navigation.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Post-capture screen that lets users select how a moment felt, updates the stored moment, clears draft data, and returns to home.",
  "frontend/src/pages/MomentsPage.tsx": "File is present but contains no implementation or exported component.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing screen that lets users update display name, location, and profile picture, copy an invite code, and navigate to home or settings. Uses local state, a profile hook, file upload with FileReader, inline toast feedback, and delayed navigation after save.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Confirmation page for saving a captured photo as a moment, allowing the user to select who it was with and add a reflection. Loads a draft from storage, saves the moment and metadata to localStorage, and then navigates to a feeling check flow.",
  "frontend/src/pages/SettingsPage.tsx": "Settings screen with navigation back to home and a logout action that clears the Internet Identity session. Renders a mobile-style list of account and subscription options with basic navigation handlers.",
  "frontend/src/pages/VaultMomentPage.tsx": "Full-screen viewer for a single saved moment, loaded by ID from route params and local storage. Displays the photo with overlays for relative time, who, reflection, and feeling, and allows navigating back to the vault.",
  "frontend/src/pages/VaultPage.tsx": "Vault overview page that loads saved moments from local storage, groups them by month, and displays recent photos in animated grids. Listens for storage updates and navigates to individual moment views on thumbnail click.",
  "frontend/src/pages/WelcomePage.tsx": "Animated welcome/intro page with entrance animations and a call-to-action to get started. Uses refs to trigger CSS animations and navigates to the home page when the user continues.",
  "frontend/src/utils/momentsPhotosStorage.ts": "Provides localStorage-based utilities and types for saving, loading, updating, and querying photo-based moments, including metadata like reflections and feelings, with custom events for same-tab updates.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "Implements sessionStorage helpers for temporarily persisting an in-progress moment draft and confirmation data during the current session, including cleanup after save.",
  "frontend/src/utils/plannedMomentShareText.ts": "Generates human-readable share text for a planned moment by formatting its date and time and interpolating an optional display name and title.",
  "frontend/src/utils/plannedMomentsStorage.ts": "Manages local-first storage for planned moments with one-per-day enforcement, deterministic pastel color assignment, CRUD helpers, and custom events for UI updates.",
  "frontend/src/utils/profileStorage.ts": "Handles localStorage persistence of a user profile, including generating and ensuring an invite code, saving profile data, and emitting update events.",
  "frontend/src/utils/timeFormat.ts": "Defines a utility to format timestamps into short relative time strings (seconds to days) or a fallback calendar date for older events.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read parameters from the URL or hash, persist them in sessionStorage, retrieve or clear them, and scrub sensitive hash parameters without reloading.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, custom OKLCH-based color tokens, layout extensions, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the high-level project state, schema version, and a structured summary of the Moments app’s goals, architecture, and existing implemented features."
}