{
  "backend/main.mo": "Motoko canister defining user profiles and a Moments photo system with access control, including profile CRUD, photo metadata tracking, and blob storage integration via mixins.",
  "feature_evidence.json": "Feature evidence report mapping specific Home screen planning UX features to frontend files, dependencies, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend files describing routing, pages, components, styles, and hooks for build and feature planning.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions using an OKLCH color system, dark mode support, and custom styles for Home calendar strips, planning cards, and CTA buttons.",
  "frontend/index.html": "HTML entry point configuring viewport behavior, preloading splash media assets, loading Font Awesome, and mounting the React app.",
  "frontend/src/App.tsx": "Main React application router setup using TanStack Router, defining all core routes such as splash, home, camera, calendar, vault, profile, and settings.",
  "frontend/src/components/HamburgerMenu.tsx": "Animated hamburger menu component file; content is currently empty or omitted in this snapshot.",
  "frontend/src/components/HomeWeeklyCalendarStrip.tsx": "Home screen weekly calendar strip component with week navigation, date selection, and color-coded day pills indicating planned moments.",
  "frontend/src/components/InlineToast.tsx": "Lightweight inline toast notification component with timed auto-dismiss, fade animations, and optional close callback.",
  "frontend/src/components/MomentsImageCard.tsx": "React component that renders a styled card for a photo moment, including avatar, name, location, timestamp, image, and optional metadata like who, reflection, and feeling emoji.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "Bottom sheet UI component for planning a moment, allowing users to select date, time, optional title, auto-assign a color, and save or cancel with animated open/close behavior.",
  "frontend/src/components/PlannedMomentCard.tsx": "Presentational component that displays a planned moment with formatted date, time, optional title, and a background color derived from the moment data.",
  "frontend/src/components/SignInOverlay.tsx": "Empty file placeholder for a SignInOverlay component with no implementation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent React Query caches when the actor changes.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Hook that automatically requests browser geolocation once per session when enabled and invokes a callback with latitude and longitude on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, including login, logout, persisted identity loading, and detailed login status flags.",
  "frontend/src/hooks/useInView.ts": "IntersectionObserver-based hook that tracks whether a referenced element is in view, with configurable threshold, root margin, and optional one-time triggering.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Hook that loads moment photos from local storage, tracks the most recent photo, and refreshes state on storage or custom update events.",
  "frontend/src/hooks/usePlannedMoments.ts": "Hook that manages planned moments stored locally, exposing moments by date, all moments, date metadata, and an add function with automatic refresh via storage subscriptions.",
  "frontend/src/hooks/useProfile.ts": "Hook for loading and updating a user profile from local storage, with automatic geolocation request to fill location data when missing.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks that interact with the backend.",
  "frontend/src/index.css": "Global Tailwind CSS setup with imported Google font, light/dark theme CSS variables (OKLCH), base styles, and custom UI styles for glass cards, home planning surfaces, and calendar components.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, wires React Query via QueryClientProvider, and wraps the app with InternetIdentityProvider and global styles.",
  "frontend/src/pages/CalendarPage.tsx": "Weekly calendar view that computes week dates, highlights days with photo or planned moments from localStorage and hooks, and opens a bottom sheet when a date is selected.",
  "frontend/src/pages/CameraScreen.tsx": "Camera capture screen using a custom useCamera hook to take or upload photos, manage camera lifecycle, save drafts to storage, and navigate to the save flow.",
  "frontend/src/pages/HomeScreen.tsx": "Main home screen showing a weekly calendar strip, planned moments, and navigation actions, coordinating bottom sheet visibility and routing to camera, calendar, vault, and profile.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Onboarding splash carousel with animated cards (images/videos), autoplay and swipe transitions, and integration with Internet Identity login before navigating into the app.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Post-capture flow screen that lets users tag a saved moment with a feeling, updates stored photo metadata, clears drafts, and returns to home.",
  "frontend/src/pages/MomentsPage.tsx": "Empty or placeholder page file with no implementation content provided.",
  "frontend/src/pages/ProfilePage.tsx": "Implements a profile editing screen where users can update display name, location, and profile picture, copy an invite code, and navigate to settings or home. Uses local state, a profile hook, file uploads, and inline toast feedback before redirecting.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Handles confirmation and metadata entry for a captured photo moment, including relationship tags and reflection text. Loads a draft from storage, saves the moment and related metadata, and routes to a feeling check flow.",
  "frontend/src/pages/SettingsPage.tsx": "Renders a settings screen with navigation back to home and a logout action that clears the Internet Identity session. Displays grouped settings options such as account and subscription.",
  "frontend/src/pages/VaultMomentPage.tsx": "Displays a single saved moment in full-screen view with photo, relative timestamp, relationship, reflection, and feeling metadata. Loads the moment by ID from storage and allows navigation back to the vault.",
  "frontend/src/pages/VaultPage.tsx": "Shows a gallery of saved moments grouped by month, with animated thumbnails and optional feeling indicators. Loads moments from storage, groups and limits them per month, and navigates to individual moment views.",
  "frontend/src/pages/WelcomePage.tsx": "Presents an animated welcome screen with styled card and text entrance effects. On user action, navigates into the main home experience.",
  "frontend/src/utils/momentsPhotosStorage.ts": "Provides localStorage-based CRUD utilities for storing photo moments with metadata like timestamp, reflection, and feeling, including helpers to fetch the most recent or a specific photo. Dispatches a custom event to notify same-tab updates.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "Manages temporary sessionStorage drafts for the moment confirmation flow, including photo data, confirmation details, and the saved moment ID. Designed to persist only within the current browser session.",
  "frontend/src/utils/plannedMomentsStorage.ts": "Implements localStorage persistence for planned (future) moments with date/time, color assignment, and event-based change notifications. Includes helpers for querying moments by date, sorting, and subscribing to storage updates.",
  "frontend/src/utils/profileStorage.ts": "Handles localStorage persistence of the user profile, including display info and a generated invite code. Ensures an invite code always exists and emits an update event on save.",
  "frontend/src/utils/timeFormat.ts": "Exports a utility to format timestamps into short relative time strings (seconds to days) and falls back to a concise date for older entries.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash routes and persisting them in sessionStorage. Supports retrieving, storing, clearing, and sanitizing parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a mobile-centered theme with OKLCH color variables, custom animations, and design tokens. Enables typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the app’s current product direction and implemented features, emphasizing a planning-first mobile SPA with onboarding, authentication, and a simplified home experience."
}