{
  "backend/main.mo": "Motoko canister implementing user profiles and a personal \"Moments\" photo collection with access control, storing photo metadata per user and delegating blob storage to a storage mixin.",
  "feature_evidence.json": "Feature evidence report mapping Vault UI/UX improvements (animations, thumbnail redesign, square images, enlarged viewer) to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of many frontend files describing routing, pages, components, styles, and design decisions across the app.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining the design system with OKLCH color tokens, light/dark themes, and base styles applied across the app.",
  "frontend/index.html": "HTML entry point configuring viewport behavior, preloading splash media assets, including Font Awesome, and mounting the React app.",
  "frontend/src/App.tsx": "Main React application file configuring TanStack Router routes for all screens including splash, onboarding, home, camera flow, calendar, vault, per-moment view, profile, and settings.",
  "frontend/src/components/HamburgerMenu.tsx": "File present but currently empty or omitted, likely intended to contain an animated hamburger menu component.",
  "frontend/src/components/InlineToast.tsx": "Reusable inline toast notification component that displays a temporary message with fade-in/out animation and optional auto-close callback.",
  "frontend/src/components/MomentsImageCard.tsx": "Presentational component rendering a glassmorphic moment card with header metadata, main image, and optional private details like who, reflection, and feeling emoji.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "Bottom sheet React component for creating a planned moment with time, title, and participant type, including animated open/close behavior and validation. Handles hour/minute input controls, option selection with colors/icons, and calls onSave with normalized data.",
  "frontend/src/components/SignInOverlay.tsx": "File present but content is empty or not provided, likely intended for a sign-in overlay UI component.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor based on the current Internet Identity, supporting anonymous and authenticated modes. Automatically reinitializes the actor on identity change and invalidates/refetches dependent queries.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Hook that automatically requests browser geolocation once per session when enabled and calls a success callback with coordinates. Uses sessionStorage and guards to avoid repeated prompts or unsupported environments.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication using DFINITY AuthClient. Handles login/logout, identity persistence, login status state, and exposes identity and helper flags to consumers.",
  "frontend/src/hooks/useInView.ts": "IntersectionObserver-based hook that reports whether a referenced element is in view. Supports configurable threshold, root margin, and one-time or continuous triggering.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Hook that loads and tracks locally stored moments photos and the most recent photo. Listens to storage and custom events to keep photo state in sync across tabs and updates.",
  "frontend/src/hooks/usePlannedMoments.ts": "Hook for managing planned moments stored locally, including loading moments for a selected date and tracking dates with moments and their colors. Provides an addMoment helper that persists and updates derived state.",
  "frontend/src/hooks/useProfile.ts": "Hook for loading and updating a user profile from local storage with automatic geolocation enrichment when location data is missing. Syncs profile changes across tabs and exposes an updateProfile helper.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks that interact with the backend, currently exporting nothing.",
  "frontend/src/index.css": "Global Tailwind and CSS variables setup defining light and dark themes using OKLCH colors, typography, and reusable styles. Includes glassmorphic card styles and keyframe animations for splash screen and UI transitions.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentity providers. Imports global styles and renders the App component into the root element.",
  "frontend/src/pages/CalendarPage.tsx": "Implements a weekly calendar view that highlights days with photo moments or planned moments, allows week navigation, and opens a bottom sheet when a date is selected.",
  "frontend/src/pages/CameraScreen.tsx": "Provides a full-screen camera interface to capture or upload a photo, manage camera state, and save a draft before navigating to the moment confirmation flow.",
  "frontend/src/pages/HomeScreen.tsx": "Renders the main home feed showing the most recent moment, profile info, search bar, and navigation actions to camera, calendar, vault, settings, and profile.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Displays an animated, swipeable onboarding splash screen with cards, autoplay transitions, and Internet Identity login before navigating into the app.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Prompts the user to select how a saved moment felt, updates the moment’s feeling, clears draft data, and redirects back to home.",
  "frontend/src/pages/MomentsPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/ProfilePage.tsx": "Allows viewing and editing of user profile details (name, location, picture), copying an invite code, and saving changes with feedback and navigation.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Confirmation screen for saving a captured photo as a moment, allowing the user to select who it was with and add a reflection before saving to local storage. Loads a pending draft, handles retake or save, and navigates to a feeling check after persistence.",
  "frontend/src/pages/SettingsPage.tsx": "Settings screen with navigation back to home and logout functionality using Internet Identity. Renders account and subscription options in a mobile-styled layout.",
  "frontend/src/pages/VaultMomentPage.tsx": "Full-screen viewer for a single saved moment loaded by ID, showing the photo with metadata like time, relationship, reflection, and feeling. Redirects back to the vault if the moment is invalid or missing.",
  "frontend/src/pages/VaultPage.tsx": "Vault overview page that loads saved moments from local storage, groups them by month, and displays them in animated thumbnail grids. Handles navigation to individual moment views and listens for storage updates.",
  "frontend/src/pages/WelcomePage.tsx": "Animated welcome/onboarding page with styled card and text entrance animations. Navigates the user to the home screen when they choose to get started.",
  "frontend/src/utils/momentsPhotosStorage.ts": "Local-first utility module for storing, retrieving, and updating moment photos in localStorage. Defines the MomentsPhoto data model and dispatches custom events on changes for UI updates.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "Provides sessionStorage-based helpers to temporarily save, load, and clear a photo moment draft, its confirmation fields, and the saved moment ID during the confirmation flow.",
  "frontend/src/utils/plannedMomentsStorage.ts": "Implements localStorage persistence for planned (non-photo) moments, including creation, date-based retrieval, and utilities to derive dates and colors for calendar views.",
  "frontend/src/utils/profileStorage.ts": "Manages local-first user profile storage in localStorage, ensuring an invite code exists and dispatching a custom event when the profile is updated.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into short relative time strings (seconds to days) and falls back to a concise calendar date for older events.",
  "frontend/src/utils/urlParams.ts": "Utilities to read URL parameters from query strings or hash routes, persist them in sessionStorage, retrieve or clear them, and safely handle sensitive hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content sources, dark mode, container settings, extended OKLCH-based color tokens, radii, animations, and plugin integrations.",
  "project_state.json": "Machine-readable snapshot of project state and direction, listing current features, versions, and a high-level product summary guiding future UI and navigation changes."
}