{
  "backend/main.mo": "Motoko canister handling user profiles, authorization, and storing/retrieving photo metadata using mixin-based blob storage.",
  "feature_evidence.json": "Structured report listing implemented features, associated files, components, and test references for traceability.",
  "frontend-file-summaries.txt": "Prewritten summary map describing the purpose and behavior of key frontend files.",
  "frontend/index.css": "Global Tailwind CSS base layer defining OKLCH color tokens, light/dark modes, and shared UI variables.",
  "frontend/index.html": "Root HTML document setting viewport rules, preloading splash assets, and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for splash, onboarding, home, camera, vault/moments, notifications, and other screens.",
  "frontend/src/components/ConfirmDeleteModal.tsx": "Reusable modal component for confirming deletion actions with a backdrop and cancel/confirm buttons.",
  "frontend/src/components/EmojiFloatOverlay.tsx": "Generates animated floating emojis with staggered delays, respecting reduced‑motion settings.",
  "frontend/src/components/HamburgerMenu.tsx": "Empty file placeholder for a hamburger menu component.",
  "frontend/src/components/HomeWeeklyCalendarStrip.tsx": "Renders a weekly calendar strip with navigation, date selection, and visual indicators for dates with moments.",
  "frontend/src/components/InlineToast.tsx": "Displays a temporary toast message with fade animations and configurable placement.",
  "frontend/src/components/MomentsImageCard.tsx": "Shows a moments photo with user info, timestamp, image, and optional metadata such as who, reflection, and feeling.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "Provides a bottom-sheet UI for creating planned moments with time, date selection, and auto-assigned colors.",
  "frontend/src/components/PlannedMomentCard.tsx": "Displays a planned moment with formatted date/time, color indicator, and share/delete actions.",
  "frontend/src/components/SignInOverlay.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor updates.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Requests geolocation once per session and returns coordinates via callback when enabled.",
  "frontend/src/hooks/useBackSlideNavigation.ts": "Provides a slide-back exit animation handler before triggering navigation.",
  "frontend/src/hooks/useGentleAutoScroll.ts": "Enables gentle auto-scrolling of a container with pause-on-interaction and reduced-motion support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication using AuthClient with login, logout, and status handling.",
  "frontend/src/hooks/useInView.ts": "Hook using IntersectionObserver to detect when an element enters the viewport and expose a ref and boolean.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Loads stored moment photos, tracks the most recent, and updates on storage or custom events.",
  "frontend/src/hooks/usePlannedMoments.ts": "Manages planned moments state, syncing with storage, and provides add/delete helpers and date metadata.",
  "frontend/src/hooks/useProfile.ts": "Handles user profile loading, saving, auto-geolocation population, and updates via events or storage changes.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend React Query hooks with no current functionality.",
  "frontend/src/hooks/useSwipeGesture.ts": "Implements touch and mouse swipe detection with thresholding and scroll prevention, exposing listener attachment.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, light/dark design tokens, and custom components styling including glass card and calendar UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/CalendarPage.tsx": "Renders a weekly calendar view with planned/photo moment indicators, navigation, and bottom sheet interaction.",
  "frontend/src/pages/CameraScreen.tsx": "Camera screen that handles camera activation, photo capture, file upload, draft saving, and navigation.",
  "frontend/src/pages/HomeScreen.tsx": "Home dashboard showing planned moments, calendar, navigation, sharing, and moment management.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Animated multi‑card onboarding splash screen with auto‑advance and Internet Identity login flow.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Lets users assign a feeling to a saved moment, updates storage, clears draft, and redirects to vault.",
  "frontend/src/pages/MomentsPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/NotificationsPage.tsx": "Notifications page with slide‑back navigation and an empty‑state message.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page allowing name, location, picture updates, invite‑code copying, and navigation.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Handles loading a captured moment draft, letting the user add who/notes, and saving it to local storage before navigating to the feeling check.",
  "frontend/src/pages/SettingsPage.tsx": "Displays settings UI with navigation, account/subscription placeholders, and logout handling using Internet Identity.",
  "frontend/src/pages/VaultMomentPage.tsx": "Shows a single saved moment with swipe navigation, feeling display, and delete confirmation.",
  "frontend/src/pages/VaultPage.tsx": "Loads and groups saved moments by month, renders a grid with delete options, and navigates to individual moment pages.",
  "frontend/src/pages/WelcomePage.tsx": "Shows animated welcome screen with entrance effects and a button to go to the home page.",
  "frontend/src/utils/momentFeelings.ts": "Defines feeling types and options with labels and emojis, plus helper functions to get their emoji, label, or full option.",
  "frontend/src/utils/momentsPhotosStorage.ts": "LocalStorage helpers for saving, loading, updating, and capping moment photos at 10 items with event dispatching and error handling.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "SessionStorage utilities for saving, loading, and clearing temporary moment drafts, confirmations, and saved moment IDs.",
  "frontend/src/utils/plannedMomentShareText.ts": "Generates human-readable share text for planned moments using formatted date, time, title, and optional display name.",
  "frontend/src/utils/plannedMomentsStorage.ts": "LocalStorage management for planned moments with deterministic color assignment, one-per-day enforcement, and change events.",
  "frontend/src/utils/profileStorage.ts": "LocalStorage-based user profile loader and saver that ensures an invite code exists and emits update events.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into relative time strings like seconds, minutes, hours, days, or short dates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and optionally cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, OKLCH color variables, animations, and plugin setup.",
  "project_state.json": "Stores the project’s high-level app description, version info, and a list of implemented features with IDs, titles, synonyms, descriptions, and versions. Captures current client-side, backend, and UI capabilities for planning future development."
}