{
  "backend/main.mo": "Motoko canister implementing user profiles, permission checks, and photo storage using blob storage mixin with access control.",
  "feature_evidence.json": "Feature evidence report mapping two deployment features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files and components.",
  "frontend/index.css": "Tailwind base CSS defining OKLCH color tokens, dark mode variants, and global style variables.",
  "frontend/index.html": "HTML entry file with build version metadata, preload directives, viewport settings, and Font Awesome inclusion.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and running a build-version guard with cache refresh logic.",
  "frontend/src/components/HamburgerMenu.tsx": "Empty placeholder file for a hamburger menu component.",
  "frontend/src/components/HomePlannedDatesRow.tsx": "Scrollable planned-dates row with auto-drift animation, interaction pausing, and rendering of date pills with color segments.",
  "frontend/src/components/HomeWeeklyCalendarStrip.tsx": "Weekly calendar strip that displays a selectable week, supports navigation, highlights days with moments, and outputs selection events.",
  "frontend/src/components/InlineToast.tsx": "Simple fading inline toast that auto-hides after a duration and triggers an optional close callback.",
  "frontend/src/components/MomentsImageCard.tsx": "Card component showing a moment photo with user info, metadata, reflection text, and feeling indicator.",
  "frontend/src/components/PlannedDatePill.tsx": "Clickable pill showing a formatted date with up to three colored background segments.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "Bottom sheet for creating a planned moment with date, time, title, and auto‑assigned color, supporting animated open/close.",
  "frontend/src/components/SignInOverlay.tsx": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Hook requesting geolocation once per session and invoking a callback with coordinates when allowed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login state, stored identities, and AuthClient creation.",
  "frontend/src/hooks/useInView.ts": "Hook using IntersectionObserver to track whether an element is in view with optional one‑time triggering.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Loads moment photos from storage, tracks the most recent photo, and updates state when storage events occur.",
  "frontend/src/hooks/usePlannedMoments.ts": "Manages planned moments for a selected date, syncing with storage changes and providing an add-moment helper.",
  "frontend/src/hooks/useProfile.ts": "Loads and updates the user profile, with optional auto‑geolocation and event-based profile syncing.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode colors, scrollbar styles, and custom UI animations/buttons.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/CalendarPage.tsx": "Renders a weekly calendar, detecting photo and planned moments per date and opening a bottom sheet on selection.",
  "frontend/src/pages/CameraScreen.tsx": "Manages camera usage, photo capture, file uploads, and draft saving before navigating to the confirmation screen.",
  "frontend/src/pages/HomeScreen.tsx": "Displays the home layout with calendar strips, planned dates, and navigation, opening a planner bottom sheet on date selection.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Animated mobile splash screen with swipeable intro cards and Internet Identity login navigation.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Prompts the user to select a feeling for a saved moment and updates local moment data before returning home.",
  "frontend/src/pages/MomentsPage.tsx": "Empty placeholder file for the moments list page.",
  "frontend/src/pages/ProfilePage.tsx": "User profile editor supporting name, location, photo upload, and navigation to settings with toast feedback.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Displays captured photo and collects 'who' and reflection inputs before saving the moment and routing to feeling check.",
  "frontend/src/pages/SettingsPage.tsx": "Settings view with navigation and logout via Internet Identity.",
  "frontend/src/pages/VaultMomentPage.tsx": "Displays a single saved moment with metadata and provides navigation back to the vault.",
  "frontend/src/pages/VaultPage.tsx": "Displays grouped photo moments by month with lazy‑loaded sections and navigation to individual moment pages.",
  "frontend/src/pages/WelcomePage.tsx": "Renders the animated welcome screen and navigates users to the home page when getting started.",
  "frontend/src/utils/buildInfo.ts": "Provides build version constants and utilities for verifying, storing, and refreshing cache based on version changes.",
  "frontend/src/utils/momentsPhotosStorage.ts": "Handles localStorage CRUD operations for photo moments, including saving, updating, loading, and retrieving by ID.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "Manages temporary sessionStorage drafts and confirmations for the moment‑creation flow.",
  "frontend/src/utils/plannedMomentsStorage.ts": "Stores and retrieves planned moments, assigns deterministic colors, and emits change events for UI updates.",
  "frontend/src/utils/profileStorage.ts": "Loads and saves the user profile locally, generating an invite code if missing and emitting update events.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into concise relative time strings or short dates for older entries.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from storage or the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Captures the app’s current product direction, feature inventory, and versioned state description for planning and evolution tracking."
}