{
  "backend/main.mo": "Motoko canister defining user profiles and a Moments photo collection with access control, storing photo metadata per user and integrating blob storage via mixins.",
  "feature_evidence.json": "Structured report enumerating implemented frontend features, affected files, dependencies, test IDs, and confidence levels for recent UI and behavior changes.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of many frontend files, intended as documentation or planning reference rather than executable code.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions using an OKLCH color system, light/dark themes, and base styling applied across the app.",
  "frontend/index.html": "HTML entry point configuring viewport behavior, preloading splash media assets, loading Font Awesome, and mounting the React app.",
  "frontend/src/App.tsx": "Main React application component that sets up TanStack Router routes for all primary pages including splash, home, camera, moments, and profile.",
  "frontend/src/components/HamburgerMenu.tsx": "Empty file placeholder for a HamburgerMenu component; no implementation is present in this version.",
  "frontend/src/components/InlineToast.tsx": "Reusable inline toast notification component with timed auto-dismiss, fade/slide animations, and optional close callback.",
  "frontend/src/components/MomentsImageCard.tsx": "UI component rendering a glassmorphic Moments photo card with header metadata, main image, and engagement actions (like, comment, share).",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "React bottom sheet component for creating a planned moment with time, title, and participant type, handling open/close animations and form validation before saving.",
  "frontend/src/components/SignInOverlay.tsx": "File exists as a placeholder or empty component; no implementation is currently defined.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor using React Query, reinitializing it when Internet Identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Hook that automatically requests browser geolocation once per session when enabled and returns coordinates via a success callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, handling login, logout, persisted identities, and login state management.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Hook for loading and tracking stored moment photos, including the most recent photo, and reacting to storage or custom update events.",
  "frontend/src/hooks/usePlannedMoments.ts": "Hook for managing planned moments stored locally, including loading moments by date, tracking dates with moments, and adding new moments.",
  "frontend/src/hooks/useProfile.ts": "Hook for loading and updating the user profile from local storage, with automatic geolocation capture when location data is missing.",
  "frontend/src/hooks/useQueries.ts": "Reserved file for future React Query backend hooks; currently exports nothing.",
  "frontend/src/index.css": "Global Tailwind and custom CSS defining light/dark themes, OKLCH color variables, typography, glassmorphic cards, and splash screen animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers.",
  "frontend/src/pages/CalendarPage.tsx": "Implements a weekly calendar view that highlights dates with photo moments and planned moments, sourced from localStorage and a custom usePlannedMoments hook. Handles week navigation, date selection, and opening a bottom sheet to manage planned moments for a selected day.",
  "frontend/src/pages/CameraScreen.tsx": "Provides a full-screen camera interface using a custom useCamera hook to capture photos, switch cameras, and handle uploads. Captured images are saved to localStorage as moments and the user is navigated back home after saving or closing.",
  "frontend/src/pages/HomeScreen.tsx": "Renders the main home dashboard with header navigation, profile display, and entry points to camera, calendar, moments, settings, and profile pages. Displays the most recent moment photo and uses profile and moments hooks for data.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Implements an animated, card-based onboarding splash experience with autoplay transitions and media (video/images). Integrates Internet Identity login and navigates users onward once authentication succeeds.",
  "frontend/src/pages/MomentsPage.tsx": "Displays saved moment photos in a vertical, swipe- and scroll-driven full-screen viewer with background music. Loads photos from localStorage and allows navigation back to the home screen.",
  "frontend/src/pages/ProfilePage.tsx": "Implements a mobile-style profile editing page that lets users update display name, location, and profile picture, copy an invite code, and persist changes via a profile hook before navigating back home.",
  "frontend/src/pages/SettingsPage.tsx": "Renders a settings screen with navigation back to home and logout functionality, clearing the Internet Identity session and providing stub UI sections for account and subscription settings.",
  "frontend/src/pages/WelcomePage.tsx": "Displays an animated welcome/onboarding screen with card and text entrance animations and a call-to-action that navigates the user to the home page.",
  "frontend/src/utils/momentsPhotosStorage.ts": "Provides localStorage utilities to save, load, and retrieve the most recent photo moment stored as base64 data with timestamps.",
  "frontend/src/utils/plannedMomentsStorage.ts": "Defines localStorage helpers for creating, loading, and querying planned moments by date, including deterministic color mapping and time-based sorting.",
  "frontend/src/utils/profileStorage.ts": "Handles local-first user profile persistence with automatic invite code generation, safe loading/saving, and a custom event to notify same-tab updates.",
  "frontend/src/utils/timeFormat.ts": "Contains a utility to format timestamps into short relative time strings (seconds to days) or a concise calendar date for older entries.",
  "frontend/src/utils/urlParams.ts": "Includes helpers to read URL parameters from query or hash, persist them in sessionStorage, and manage sensitive parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend source files, and extending the theme with container settings, OKLCH-based design tokens, custom radii, shadows, and accordion animations. It registers typography, container-queries, and animation plugins.",
  "project_state.json": "Project metadata describing the current state and features of the Moments mobile-first React app, including onboarding, authentication, routing, and UI direction changes like glassmorphic cards and geolocation. It tracks schema/versioning and enumerates implemented features with IDs, descriptions, and versions."
}