{
  "backend/main.mo": "Motoko canister defining user profiles and a Moments photo collection with access control, storing photo metadata and blobs via mixins, and enforcing authenticated user/admin permissions.",
  "feature_evidence.json": "Feature evidence report documenting UI regressions fixes for button styling and splash/onboarding animations, linking them to frontend CSS files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Aggregated JSON-style documentation summarizing the purpose and behavior of frontend source files, pages, hooks, components, and configuration.",
  "frontend/index.css": "Global Tailwind CSS base defining design tokens (OKLCH colors, radius, dark mode) and foundational styles for backgrounds, borders, and typography.",
  "frontend/index.html": "HTML entry point configuring viewport, preloading splash media assets, including Font Awesome, and mounting the React app.",
  "frontend/src/App.tsx": "Main React application that configures TanStack Router routes for splash, welcome, home, camera, calendar, moments, and settings pages.",
  "frontend/src/components/HamburgerMenu.tsx": "Placeholder for an animated hamburger menu component; file currently contains no implementation.",
  "frontend/src/components/SignInOverlay.tsx": "Placeholder for an Internet Identity sign-in overlay component; file currently contains no implementation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend canister actor using Internet Identity, initializes access control, and coordinates query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive authentication context and hook for Internet Identity, managing login state, persisted delegation, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Reserved placeholder file for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining light/dark theme variables with OKLCH colors, base styles, font import, and shared animations for splash screens, cards, and UI transitions.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, sets up React Query, wraps the app with Internet Identity authentication, and loads global styles.",
  "frontend/src/pages/CalendarPage.tsx": "Implements a calendar view with month navigation, date selection, animations, and loading of photo moments associated with selected dates.",
  "frontend/src/pages/CameraScreen.tsx": "Camera capture screen using a custom camera hook to take photos, preview them, save to localStorage as moments, and navigate back to home.",
  "frontend/src/pages/HomeScreen.tsx": "Main home screen UI for mobile layout with header, search bar, and navigation actions to camera, calendar, moments, and settings.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Animated onboarding splash screen with sliding cards, media content, auto-play transitions, and integration with Internet Identity login flow.",
  "frontend/src/pages/MomentsPage.tsx": "Implements a full-screen mobile-style Moments viewer that loads saved photos from localStorage and allows vertical navigation via touch swipes or mouse wheel. It also auto-plays looping background music and provides a back button to return to the home page.",
  "frontend/src/pages/SettingsPage.tsx": "Renders a mobile-styled Settings screen with grouped options like Account and Subscription, along with navigation controls. Supports returning to home and logging out by clearing Internet Identity state.",
  "frontend/src/pages/WelcomePage.tsx": "Displays an animated welcome card after authentication, with slide-in text and imagery. Provides actions to continue to the home screen or sign out and return to the splash screen.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, and clearing them securely. Designed to support sensitive tokens and state across navigation without page reloads.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom color tokens, border radii, animations, and container settings tailored to the app’s design system. Enables dark mode via class and includes typography, container queries, and animation plugins.",
  "project_state.json": "Defines the high-level project snapshot, including app summary, schema versioning, and a catalog of implemented features. Serves as a structured reference for current functionality and build planning."
}