{
  "backend/main.mo": "Motoko canister implementing user profiles, photo metadata, blob storage, and an admin‑gated build deployment system with draft and production promotion logic.",
  "feature_evidence.json": "Feature evidence report documenting the promotion of draft build 140, including related files, components, and test references.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose and behavior of various frontend source files.",
  "frontend/DEPLOYMENT_PROMOTION.md": "Guide explaining how to promote draft build version 140 to production using backend admin methods.",
  "frontend/DEPLOYMENT_STATUS.md": "Status document tracking deployment history, showing draft version 140 pending promotion and listing included features.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH theme variables, dark mode tokens, and base layout styles.",
  "frontend/index.html": "HTML entry point that preloads splash media, loads Font Awesome, and mounts the React application.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration and page routes for splash, onboarding, home, camera, vault, and settings flows.",
  "frontend/src/components/ConfirmDeleteModal.tsx": "Reusable modal component for confirming deletion actions with backdrop, title, message, and action buttons.",
  "frontend/src/components/EmojiFloatOverlay.tsx": "Component generating animated floating emojis with staggered motion and reduced‑motion accessibility support.",
  "frontend/src/components/HamburgerMenu.tsx": "Empty file with no implemented component content.",
  "frontend/src/components/HomeWeeklyCalendarStrip.tsx": "Weekly calendar strip component with week navigation, date selection, and color indicators for dates with moments.",
  "frontend/src/components/InlineToast.tsx": "Transient toast notification component with fade animations, configurable placement, and success/warning styles.",
  "frontend/src/components/MomentsImageCard.tsx": "Displays a moment photo with user info, timestamp, metadata, and optional emotion, reflection, and who details.",
  "frontend/src/components/NotificationPopupBubble.tsx": "Small popup bubble showing a notification message with avatar and dismiss button.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "Bottom sheet for creating or editing planned moments with time, date, title input, and animated open/close behavior.",
  "frontend/src/components/PlannedMomentCard.tsx": "Card displaying a planned moment’s date, title, time, color marker, and share/delete actions.",
  "frontend/src/components/SignInOverlay.tsx": "Empty file containing no implementation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on identity and resets dependent queries when it changes.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Hook that requests geolocation once per session and returns coordinates via callback when enabled.",
  "frontend/src/hooks/useBackSlideNavigation.ts": "Hook providing slide-back exit animation state and a handler that triggers navigation after the animation.",
  "frontend/src/hooks/useGentleAutoScroll.ts": "Provides continuous upward auto-scrolling with pause on user interaction and reduced‑motion support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, stored identity loading, and context exposure.",
  "frontend/src/hooks/useInView.ts": "Uses IntersectionObserver to report when an element enters the viewport, optionally only once.",
  "frontend/src/hooks/useLocalNotifications.ts": "Loads, tracks, and updates local notifications with unread counts and storage subscriptions.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Loads stored moments photos and updates when storage or custom events change.",
  "frontend/src/hooks/useNotificationPopups.ts": "Shows popup notifications for new local notifications and auto-dismisses them after a timeout.",
  "frontend/src/hooks/usePlannedMoments.ts": "Manages planned moments data, including date filtering, storage syncing, and CRUD operations.",
  "frontend/src/hooks/useProfile.ts": "Handles user profile loading, updates, and auto-geolocation when missing.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks.",
  "frontend/src/hooks/useSwipeGesture.ts": "Detects horizontal swipe gestures and triggers callbacks with optional scroll prevention.",
  "frontend/src/index.css": "Defines global Tailwind styles, light/dark mode design tokens, and custom UI classes including glassmorphic cards and calendar strip styling.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, rendering the main App component.",
  "frontend/src/pages/CalendarPage.tsx": "Implements a weekly calendar view with date selection, planned/photo moment indicators, and a bottom sheet for moment actions.",
  "frontend/src/pages/CameraScreen.tsx": "Provides camera capture functionality with photo preview, retake, upload, and draft saving before navigating to confirmation.",
  "frontend/src/pages/HomeScreen.tsx": "Renders the home dashboard with weekly calendar, planned moments, navigation actions, and notification handling.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Displays an animated multi-card mobile splash screen with auto-play transitions and login integration.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Lets users select a feeling for a saved moment, updates storage, triggers first-time notifications, and navigates to the moment’s vault page.",
  "frontend/src/pages/MomentsPage.tsx": "File is empty or not yet implemented.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays local notifications with read/unread state, supports marking as read, and navigates back with slide animation.",
  "frontend/src/pages/ProfilePage.tsx": "Allows editing profile details, updating profile storage, handling avatar uploads, and triggering a first-save notification.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Confirms saving a captured photo or video as a moment, stores metadata, and routes to the feeling check step.",
  "frontend/src/pages/SettingsPage.tsx": "Shows settings options, supports logout via Internet Identity, and uses slide-back navigation.",
  "frontend/src/pages/VaultMomentPage.tsx": "Displays a single moment with swipe navigation, metadata overlays, and exit animations.",
  "frontend/src/pages/VaultPage.tsx": "Shows grouped moments in a grid with lazy loading, delete actions, and first‑visit notification handling.",
  "frontend/src/pages/WelcomePage.tsx": "Renders the animated welcome screen and navigates to the home page on start.",
  "frontend/src/utils/localNotificationsStorage.ts": "Manages local notification storage, trigger tracking, and event updates for personalized user notifications.",
  "frontend/src/utils/momentFeelings.ts": "Defines feeling options and helpers for retrieving feeling emojis, labels, and metadata.",
  "frontend/src/utils/momentsPhotosStorage.ts": "Handles local storage for moment photos, including saving, updating, loading, and triggering first‑photo notifications.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "Provides session-based storage for moment drafts, confirmations, and temporary saved IDs.",
  "frontend/src/utils/plannedMomentShareText.ts": "Generates shareable text for a planned moment by formatting its date, time, and optional display name.",
  "frontend/src/utils/plannedMomentsStorage.ts": "Provides localStorage CRUD for planned moments with one-per-day enforcement, color assignment, events, and notifications.",
  "frontend/src/utils/profileStorage.ts": "Manages user profile storage in localStorage with automatic invite code creation and update events.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into short relative time strings or fallback date formats.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and cleaning sensitive values from the hash.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, OKLCH-based color system, animations, and plugins.",
  "project_state.json": "Describes overall project state, features, and architecture metadata for the Moments app."
}