{
  "backend/main.mo": "Motoko canister implementing user profiles and a per-user Moments photo collection with access control, authorization mixins, and blob storage integration for storing photo blobs and metadata.",
  "feature_evidence.json": "Structured report documenting implemented product features, mapping feature requirements to frontend files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files describing routing, pages, components, styles, hooks, and overall app behavior for planning and documentation.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions using an OKLCH color system, light/dark themes, typography, and shared UI styles for calendar strips and bottom sheets.",
  "frontend/index.html": "HTML entry point configuring viewport behavior, preloading splash media assets, loading Font Awesome icons, and mounting the React app.",
  "frontend/src/App.tsx": "Main React application router using TanStack Router, defining routes for splash, onboarding, home, camera, calendar, vault, profile, and settings pages.",
  "frontend/src/components/HamburgerMenu.tsx": "File present but currently empty, likely intended for an animated hamburger menu component.",
  "frontend/src/components/HomeWeeklyCalendarStrip.tsx": "Interactive weekly calendar strip component allowing week navigation, date selection, and visual indicators for planned moments with color coding.",
  "frontend/src/components/InlineToast.tsx": "Reusable inline toast notification component that displays a temporary message with fade-in/out animation and optional auto-dismiss callback.",
  "frontend/src/components/MomentsImageCard.tsx": "React component that renders a styled photo card for a captured moment, showing an image with header metadata (avatar, name, location, timestamp) and optional private details like who it was with, a reflection, and a feeling indicator.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "Bottom sheet UI component for creating a planned moment, allowing users to pick a time, optional title, and who the moment is with, then saving it with an associated color and date.",
  "frontend/src/components/SignInOverlay.tsx": "File is present but contains no implementation or exported code.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor using React Query, handling authenticated and anonymous identities and refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Hook that automatically requests browser geolocation once per session when enabled and returns coordinates via a success callback without throwing on errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, including login, logout, identity persistence, and detailed login status flags.",
  "frontend/src/hooks/useInView.ts": "IntersectionObserver-based hook that tracks whether a DOM element is in view, with configurable thresholds and optional one-time triggering.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Hook that loads locally stored moment photos, tracks the most recent photo, and updates state in response to storage or custom update events.",
  "frontend/src/hooks/usePlannedMoments.ts": "Hook that manages planned moments from local storage, exposing moments for a selected date along with calendar metadata and a function to add new moments.",
  "frontend/src/hooks/useProfile.ts": "Hook that loads and updates the user profile from local storage, auto-requests geolocation when missing, and syncs changes across tabs and events.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks that interact with the backend, currently exporting nothing.",
  "frontend/src/index.css": "Global Tailwind CSS setup with imported Google font, extensive OKLCH-based light/dark theme variables, and base styles. Also defines custom UI styles for glass cards, home planning containers, and weekly calendar components.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers. Imports global styles and renders the main App component.",
  "frontend/src/pages/CalendarPage.tsx": "Implements a weekly calendar view with navigation, date selection, and indicators for photo and planned moments. Integrates planned moments state, localStorage photo checks, and a bottom sheet for date actions.",
  "frontend/src/pages/CameraScreen.tsx": "Provides a mobile camera capture screen using a custom camera hook, supporting photo capture, retake, file upload fallback, and draft saving. Navigates users through the capture and save flow with error handling for unsupported devices.",
  "frontend/src/pages/HomeScreen.tsx": "Defines the main home screen with logo header, search bar, weekly calendar strip, and navigation to camera, calendar, vault, and profile. Manages date selection and opens a planning bottom sheet.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Implements a multi-card animated onboarding splash screen with images/videos, autoplay transitions, and Internet Identity login integration. Handles slide navigation, animations, and redirect after successful authentication.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Displays a post-capture prompt asking users to tag a moment with a feeling and updates stored moment data. Loads the saved moment ID, clears drafts, and redirects back to home after selection.",
  "frontend/src/pages/MomentsPage.tsx": "Empty or placeholder page file with no implemented content.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page that lets users update display name, location, and profile picture, copy an invite code, and navigate to settings or home with toast feedback.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Confirmation screen for saving a captured photo as a moment, allowing selection of who it was with and an optional reflection before persisting to local storage and navigating to a feeling check.",
  "frontend/src/pages/SettingsPage.tsx": "Settings screen with navigation back to home and a logout action that clears the Internet Identity session and redirects to the landing page.",
  "frontend/src/pages/VaultMomentPage.tsx": "Full-screen viewer for a single saved moment, loading by ID from storage and displaying the photo with metadata such as time, who, reflection, and feeling.",
  "frontend/src/pages/VaultPage.tsx": "Vault overview page that loads saved moments, groups them by month, and displays animated thumbnail grids with navigation to individual moment views.",
  "frontend/src/pages/WelcomePage.tsx": "Animated welcome screen with branded visuals and entrance effects that navigates the user to the home page when getting started.",
  "frontend/src/utils/momentsPhotosStorage.ts": "Provides localStorage-based utilities for saving, loading, updating, and querying captured moment photos, including metadata like reflection and feeling. Emits a custom browser event to notify same-tab listeners of photo changes.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "Implements sessionStorage-backed temporary storage for in-progress moment drafts, confirmation details, and the saved moment ID during the capture flow. Data persists only for the current browser session and can be cleared atomically.",
  "frontend/src/utils/plannedMomentsStorage.ts": "Manages localStorage persistence for planned calendar moments, including creation, date-based queries, and deterministic color mapping per date. Dispatches custom and storage events to keep UI in sync across and within tabs.",
  "frontend/src/utils/profileStorage.ts": "Handles localStorage persistence of the user profile, ensuring an invite code is generated and present. Dispatches a custom event when profile data is updated for reactive UI updates.",
  "frontend/src/utils/timeFormat.ts": "Defines a helper to format timestamps into short relative time strings (seconds to days ago) and falls back to a concise date for older entries.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading parameters from query strings or hash-based URLs, persisting them in sessionStorage, and retrieving or clearing them across navigation. Supports secure extraction and cleanup of sensitive URL parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content sources, dark mode, container defaults, extended OKLCH-based color tokens, animations, and design tokens. Includes typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the app’s current product state, describing the Moments app concept, UX flows, and a catalog of implemented features with versions. Used to track scope, architecture, and feature completeness over time."
}