{
  "backend/main.mo": "Motoko canister defining user profiles and a Moments photo collection with access control, storing photo blobs via a storage mixin and metadata per user; enforces authenticated user/admin permissions for profile and photo access.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence UI/UX improvements to the Vault gallery and moment viewer, mapping features to frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing app routing, pages, components, hooks, styling, and configuration for build and feature planning.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions using an OKLCH color system, light/dark themes, and base styles that underpin the app’s design system and Vault visual polish.",
  "frontend/index.html": "HTML entry point configuring viewport behavior, preloading splash media assets for fast startup, and including Font Awesome for authentication overlay icons.",
  "frontend/src/App.tsx": "Main React application router using TanStack Router, defining all top-level routes for splash, onboarding, home, camera, vault, profile, and settings pages.",
  "frontend/src/components/ConfirmDeleteModal.tsx": "Reusable confirmation modal component for destructive actions, rendering a backdrop, title/message, and cancel/delete buttons with click handling.",
  "frontend/src/components/HamburgerMenu.tsx": "Placeholder file for the hamburger menu component; implementation content is empty or omitted here.",
  "frontend/src/components/HomeWeeklyCalendarStrip.tsx": "Interactive weekly calendar strip component for the home screen, allowing week navigation, date selection, and visual indicators for dates with planned moments.",
  "frontend/src/components/InlineToast.tsx": "A self-dismissing toast component that shows a message with fade/slide animation, configurable duration, placement (bottom or side), and optional onClose callback.",
  "frontend/src/components/MomentsImageCard.tsx": "Displays a photo-centric card for a moment, including user avatar, name, location, timestamp, image, and optional metadata like who, reflection, and feeling.",
  "frontend/src/components/PlannedMomentBottomSheet.tsx": "A modal bottom sheet for creating planned moments with date, time, title, and auto-assigned color, including animated open/close behavior and save/duplicate handling.",
  "frontend/src/components/PlannedMomentCard.tsx": "Renders a compact card for a planned moment showing date, optional title, time, color accent, and share/delete action buttons.",
  "frontend/src/components/SignInOverlay.tsx": "File is empty or a placeholder with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using React Query based on the current Internet Identity, handling anonymous access, admin secret initialization, and query invalidation on identity change.",
  "frontend/src/hooks/useAutoGeolocation.ts": "Automatically requests browser geolocation once per session when enabled and invokes a callback with latitude and longitude on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context, hooks, and provider for Internet Identity authentication, managing login/logout, identity persistence, and detailed login status state.",
  "frontend/src/hooks/useInView.ts": "A reusable IntersectionObserver hook that reports whether an element is in view, with configurable threshold, root margin, and trigger-once behavior.",
  "frontend/src/hooks/useMomentsPhotos.ts": "Loads and tracks stored moment photos, exposing all photos and the most recent one while reacting to storage and custom update events.",
  "frontend/src/hooks/usePlannedMoments.ts": "Manages planned moments stored in local storage, exposing moments by date, all moments, date metadata, and add/delete operations with automatic refresh.",
  "frontend/src/hooks/useProfile.ts": "Custom React hook that loads and persists a user profile from storage, auto-requests geolocation if missing, and syncs profile state via window events.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Global Tailwind and CSS theme definitions including light/dark OKLCH color tokens, typography, glassmorphic card styles, and extensive home/calendar UI styling.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/CalendarPage.tsx": "Weekly calendar page that renders selectable dates, highlights planned and photo moments from local storage, and opens a bottom sheet to manage moments.",
  "frontend/src/pages/CameraScreen.tsx": "Camera capture screen using a custom camera hook to take or upload photos, save them as drafts, and navigate to a confirmation flow.",
  "frontend/src/pages/HomeScreen.tsx": "Main home screen showing a weekly calendar strip and planned moments, handling navigation, sharing, deletion, and profile-aware interactions.",
  "frontend/src/pages/MobileSplashScreen.tsx": "Animated mobile splash/onboarding screen with swipeable cards, autoplay transitions, and Internet Identity login before navigation.",
  "frontend/src/pages/MomentFeelingCheckPage.tsx": "Page that lets the user select how a saved moment felt (Meaningful, Good, Okay), updates the moment in local storage, clears the draft, and redirects to home.",
  "frontend/src/pages/MomentsPage.tsx": "File is empty or contains no implementation.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page allowing users to update display name, location, and profile picture, copy an invite code, and navigate to settings or home with save confirmation via toast.",
  "frontend/src/pages/SaveMomentConfirmPage.tsx": "Confirmation page shown after taking a photo where users add context (who and reflection), save the moment to local storage, and proceed to the feeling check flow.",
  "frontend/src/pages/SettingsPage.tsx": "Settings screen with basic navigation and logout functionality, clearing the Internet Identity session and routing appropriately.",
  "frontend/src/pages/VaultMomentPage.tsx": "Full-screen viewer for a single saved moment, loading it by ID and displaying photo metadata such as time, who, reflection, and feeling with exit animation.",
  "frontend/src/pages/VaultPage.tsx": "Vault overview page that loads saved moments, groups them by month, displays them in a grid with feeling indicators, and navigates to individual moment views.",
  "frontend/src/pages/WelcomePage.tsx": "React welcome screen with animated card and text that plays entrance animations on mount and navigates to /home when the CTA is triggered.",
  "frontend/src/utils/momentsPhotosStorage.ts": "LocalStorage utilities for saving, loading, updating, and querying photo-based moments, including recent lookup and update events.",
  "frontend/src/utils/pendingMomentDraftStorage.ts": "SessionStorage helpers for temporarily storing a moment draft, confirmation details, and saved moment ID during a multi-step flow.",
  "frontend/src/utils/plannedMomentShareText.ts": "Generates a human-readable share message for a planned moment, formatting date and time for display.",
  "frontend/src/utils/plannedMomentsStorage.ts": "LocalStorage-based CRUD and querying for planned moments with one-per-day enforcement, deterministic color assignment, and change events.",
  "frontend/src/utils/profileStorage.ts": "Manages local-first user profile persistence, including invite code generation and update notifications.",
  "frontend/src/utils/timeFormat.ts": "Formats timestamps into short relative time strings like seconds, minutes, hours, days, or a fallback date.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (query or hash), persisting them in sessionStorage, and managing sensitive params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and layout, with typography, container queries, and animation plugins enabled.",
  "project_state.json": "High-level project state document describing the Moments mobile-first React + TypeScript SPA, its local-first architecture, Internet Identity authentication, and Motoko backend canister. It also enumerates existing implemented features (routing, auth, backend actors, UI layout, onboarding, etc.) with IDs, descriptions, and versions for build planning."
}