{
  "kind": "build_request",
  "title": "Remove Home promo card, add automatic geolocation, and apply glassmorphic card styling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the entire Home screen promotional card section shown in the provided screenshot (the orange card with the title “Plan Meaningful Moments”, the “Add Your Moment” button, and the character image). This removal must be implemented by deleting the corresponding promo-card block in `frontend/src/pages/HomeScreen.tsx` so that the section is no longer rendered on Home.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove what is shown in the screenshot",
          "“go ahead and implement this”"
        ]
      },
      "acceptanceCriteria": [
        "On the Home screen, the orange promo card with the “Plan Meaningful Moments” heading and “Add Your Moment” button no longer appears.",
        "No empty spacing or layout gap remains where the removed promo card previously rendered."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fetch the user’s location automatically via browser geolocation (permission-based) by default, and persist the result into the existing local-first user profile so it appears wherever `profile.location` is displayed (e.g., the Moments image card header). Ensure denial/unavailability is handled gracefully without breaking the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "a) automatic browser geolocation (GPS-like, permission-based)"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh session (or when location is not yet set), the app requests geolocation permission using the browser geolocation API.",
        "If permission is granted and coordinates are returned, `profile.location` is automatically updated and persisted (survives reload) using the existing profile storage/update mechanism.",
        "If permission is denied or geolocation fails/unavailable, the app continues functioning and shows the existing fallback behavior (e.g., “Location not set”) without crashes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make glassmorphic styling the new visual standard for cards across the app (excluding buttons). Implement a reusable glass card style (CSS utility/class) and update existing card containers that currently render as solid white cards (e.g., `frontend/src/components/MomentsImageCard.tsx` outer card and the Home empty-state card in `frontend/src/pages/HomeScreen.tsx`) to use the glassmorphic style while keeping all button styles unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "then instead of using white cards make them glassmorphic..",
          "apart from button but all cards.."
        ]
      },
      "acceptanceCriteria": [
        "Cards that previously used a flat white background now render with a glassmorphic look (semi-transparent fill, backdrop blur, subtle border/highlight, soft shadow) on top of the beige app background.",
        "Buttons retain their existing styling (e.g., `.yellow-button`, `.yellow-button-small`, `.yellow-button-footer`) and are not converted to glassmorphic styling.",
        "The Moments image card and the Home “No moments captured yet” empty-state card both visibly reflect the glassmorphic style."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose them instead).",
    "Do not edit immutable hook entrypoints listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Keep backend as single-actor Motoko; no new backend canisters/services."
  ],
  "nonGoals": [
    "Do not introduce GPS/maps UI or any map-based features.",
    "Do not add third-party authentication providers (only Internet Identity remains).",
    "Do not change button visual styling or global button behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}