{
  "kind": "build_request",
  "title": "Vault UX polish: motion, square thumbnails, clear enlarged view, and pulsating buttons",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add subtle motion to the Vault list screen to reduce the static/bland feel: animate month sections and photo cards on initial render and when they enter the viewport (e.g., fade/slide-up + slight scale), and add a gentle pressed/tap micro-interaction on card click.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "thevault  is bland and has no motion"
        ]
      },
      "acceptanceCriteria": [
        "When opening /vault, month headers and card grids animate in subtly (no jarring bounce).",
        "Tapping a thumbnail provides immediate visual feedback (pressed/scale-down) before navigation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Redesign Vault month card thumbnails so they look consistent and intentional: apply the app’s glassmorphic card styling standard to the thumbnail tiles (or a clearly improved equivalent), refine spacing/radius/shadows, and ensure the grid reads cleanly on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the cards look weird"
        ]
      },
      "acceptanceCriteria": [
        "Vault thumbnails have consistent corner radius, spacing, and a cohesive card surface (no mismatched/unstyled tiles).",
        "The grid remains 3 columns and does not overflow or distort on a 390x844 viewport."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure Vault photos render as true square thumbnails across all supported browsers by removing reliance on Tailwind’s `aspect-square` class (which may not be enabled) and enforcing a square layout via explicit CSS/inline aspect-ratio fallback. Keep `object-fit: cover` for thumbnails so the square crop is consistent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "photos should be square"
        ]
      },
      "acceptanceCriteria": [
        "All Vault thumbnails render as perfect squares (1:1) on mobile and desktop browsers.",
        "Thumbnails use `object-fit: cover` and do not appear stretched."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve the enlarged moment viewing experience from Vault thumbnails so the user always gets an enlarged, clear view: when a thumbnail is tapped, open a full-screen view that prioritizes the image (high contrast background, no unintended compression), and provide an obvious close/back control. Ensure the route `/vault/$momentId` (or an equivalent modal overlay) reliably shows the full image and feels “crisp”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "when you click them you dont get an enlagred clear version"
        ]
      },
      "acceptanceCriteria": [
        "Tapping a Vault thumbnail always results in a full-screen (or near full-screen) image view with a clear close/back action.",
        "The enlarged view uses the original stored image data (not a smaller thumbnail variant).",
        "The enlarged image is displayed without visible distortion; the user can see it clearly against the background."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply the same subtle pulsating animation used for the camera icon/button (`cameraPulse` / `.camera-pulse`) to all buttons across the app (including icon-only buttons like back arrows), while ensuring disabled buttons do not pulse. Provide a safe opt-out mechanism (e.g., a `no-pulse` class) for any button where pulsing harms usability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "lastly make all button pulsating like that camers icon"
        ]
      },
      "acceptanceCriteria": [
        "All clickable buttons visibly pulse with the same rhythm as the camera button.",
        "Disabled buttons do not pulse.",
        "At least one opt-out mechanism exists and is documented in code (e.g., `className=\"no-pulse\"`)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only Shadcn components). Compose them instead.",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep backend architecture single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add new backend storage or schemas for Vault; use existing localStorage-based moments data.",
    "Do not introduce new navigation tabs or a new feed-style Moments page as part of this Vault polish."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}