{
  "kind": "build_request",
  "title": "Make planned-moment pill cards slimmer and more elongated",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Adjust the planned-moment pill card styling so the card appears significantly narrower (reduced height/thickness) and more elongated horizontally, while preserving the existing border-only pill look, left color dot, and right-side action icons. Implement this by updating the CSS for the planned-moment card classes used by `frontend/src/components/PlannedMomentCard.tsx` (e.g., `.planned-moment-card-clear`, `.planned-moment-card-color-dot`, and related action/icon sizing/spacing) in `frontend/src/index.css`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make the card pill way more narrower and then longer.."
        ]
      },
      "acceptanceCriteria": [
        "Planned-moment cards render with noticeably less vertical thickness than before (reduced overall height).",
        "Cards read as more elongated capsules (higher width-to-height ratio) without changing the overall layout structure (left dot, center text stack, right stacked icons).",
        "No regressions to functionality: share and delete actions still work, and text remains readable/truncated appropriately (no overflow outside the pill).",
        "The pill remains border-only with transparent interior and border color still matches `moment.color`."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui`.",
    "Keep the card border-only/transparent style and continue using `moment.color` for the border color via `--card-border-color`."
  ],
  "nonGoals": [
    "No changes to planned-moment data models, storage, or backend APIs.",
    "No redesign of icon set or card content layout beyond size/spacing adjustments needed to achieve a slimmer/longer pill."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}