{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Home planned-moment bottom sheet, refreshed planned-moment indicators, and opt-in button pulse",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Open the planned-moment slide-up bottom sheet from Home (weekly strip tap + Start Planning CTA) without navigating away, using the selected/clicked date and closing back to Home without route changes.",
      "acceptanceCriteria": [
        "On Home, tapping any day in the weekly strip opens the planned-moment bottom sheet for that date.",
        "On Home, tapping “Start Planning” opens the planned-moment bottom sheet (defaulting to the currently selected day in the weekly strip; if none is selected, default to today).",
        "Closing/canceling the bottom sheet returns to Home and does not navigate to /calendar."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Lift selected date state into Home, wire HomeWeeklyCalendarStrip day taps to open PlannedMomentBottomSheet, and change the “Start Planning” CTA to open the same bottom sheet (no navigation). Ensure close/cancel only toggles local state so the route stays on Home."
        },
        {
          "path": "frontend/src/components/HomeWeeklyCalendarStrip.tsx",
          "operation": "modify",
          "description": "Support a controlled selected date (prop-driven) so Home can determine the currently selected day, and continue calling onDateSelect(date) on taps to drive bottom sheet open behavior."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Redesign the Planned Moment bottom sheet UI with a cleaner time selection UI (no +/- steppers), clear icons, simple icon-based “With who?” selector, and no pulsing buttons.",
      "acceptanceCriteria": [
        "The time selection UI in the bottom sheet no longer uses +/- steppers and is visually simpler/cleaner.",
        "Buttons within the bottom sheet do not pulse.",
        "The “With who?” selector remains simple and icon-based, with a clear selected state.",
        "User-facing copy remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PlannedMomentBottomSheet.tsx",
          "operation": "modify",
          "description": "Replace the current hour/minute stepper UI with a compact time input/picker (e.g., a single time input). Keep icon-based With-who options with a clear selected state, and ensure the sheet’s buttons opt out of any pulse animation via classes as needed."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust bottom sheet-related styles to match the redesigned time control (remove stepper styling dependencies, add any needed styling for the new time input/picker), and ensure the bottom sheet buttons are not animated."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Make planned moments appear on the exact chosen day and show reliable, category-color-coded indicators in the Home weekly calendar strip that update immediately after saving and remain consistent with Calendar behavior.",
      "acceptanceCriteria": [
        "After saving a planned moment, the selected date shows a color-coded indicator in the Home weekly calendar strip without requiring a refresh.",
        "The color-coded indicator corresponds to the saved moment category color (as stored with the planned moment).",
        "Planned moments are stored and retrieved for the correct ISO date (YYYY-MM-DD) so they display on the exact selected day."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Use the planned-moments hook on Home and pass dates-with-moments + date-to-color mapping into HomeWeeklyCalendarStrip so it can render immediate color-coded indicators after a save."
        },
        {
          "path": "frontend/src/components/HomeWeeklyCalendarStrip.tsx",
          "operation": "modify",
          "description": "Render planned-moment indicators on the weekly strip days (color-coded using the passed date color mapping) and ensure the indicator aligns with the exact ISO day key used for planned moments."
        },
        {
          "path": "frontend/src/utils/plannedMomentsStorage.ts",
          "operation": "modify",
          "description": "Ensure saving and lookups consistently use ISO date strings (YYYY-MM-DD) and provide stable, deterministic date-to-color mapping based on stored category color for that day."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Make planned-moment storage changes observable so saving a planned moment triggers automatic UI refresh across Home, Calendar, and any lists without manual reload.",
      "acceptanceCriteria": [
        "Saving a planned moment triggers an immediate UI update in both Home and Calendar surfaces (where applicable) without manual reload.",
        "Planned-moment indicators remain correct after navigating between Home and Calendar."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/plannedMomentsStorage.ts",
          "operation": "modify",
          "description": "Emit an observable signal on planned-moment writes (e.g., a custom window event in addition to relying on the browser storage event) so same-tab and cross-tab UIs can react immediately."
        },
        {
          "path": "frontend/src/hooks/usePlannedMoments.ts",
          "operation": "modify",
          "description": "Subscribe to planned-moment storage change signals (custom event + storage event) and refresh moments/datesWithMoments/dateColorMap automatically so any component using the hook stays in sync after saves and navigation."
        },
        {
          "path": "frontend/src/pages/CalendarPage.tsx",
          "operation": "modify",
          "description": "Ensure Calendar page relies on the observable planned-moment hook refresh behavior so weekly indicators and lists reflect newly saved planned moments immediately and remain correct after navigating between screens."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Change global pulsating button behavior to be opt-in (keep only explicitly designated buttons pulsing, e.g., camera if desired) with no regressions to disabled/hover/active states.",
      "acceptanceCriteria": [
        "Most buttons across the app no longer pulse by default.",
        "Any remaining pulsing (if kept) is limited to explicitly designated buttons only.",
        "No regressions: disabled buttons do not animate; button hover/active states still function."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove the global default pulse selector that animates most buttons, and change pulsing to opt-in via an explicit class (keeping existing camera pulsing behavior via its explicit class). Ensure disabled buttons never animate and hover/active styling remains intact."
        },
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Verify only the intended button(s) (e.g., camera) retain an explicit pulse class after the global CSS change, and ensure Home CTAs remain visually strong without relying on animation."
        }
      ]
    }
  ]
}