{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Home promo removal, auto geolocation persistence, and glassmorphic card standard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the Home promotional card block so it no longer renders and leaves no layout gap.",
      "acceptanceCriteria": [
        "On the Home screen, the orange promo card with the “Plan Meaningful Moments” heading and “Add Your Moment” button no longer appears.",
        "No empty spacing or layout gap remains where the removed promo card previously rendered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Delete the promotional card JSX block (the orange promo card section) so it is no longer rendered, and adjust surrounding spacing/margins so no visual gap remains."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Automatically request browser geolocation when profile.location is not set and persist the resulting coordinates into the existing local-first profile, while handling denial/unavailability gracefully.",
      "acceptanceCriteria": [
        "On a fresh session (or when location is not yet set), the app requests geolocation permission using the browser geolocation API.",
        "If permission is granted and coordinates are returned, `profile.location` is automatically updated and persisted (survives reload) using the existing profile storage/update mechanism.",
        "If permission is denied or geolocation fails/unavailable, the app continues functioning and shows the existing fallback behavior (e.g., “Location not set”) without crashes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAutoGeolocation.ts",
          "operation": "create",
          "description": "Create a reusable hook that uses the browser geolocation API to request permission and read coordinates when `profile.location` is missing; include a session-level guard (e.g., sessionStorage flag) to avoid repeated prompts within the same session and ensure failures/denials are caught and do not throw."
        },
        {
          "path": "frontend/src/hooks/useProfile.ts",
          "operation": "modify",
          "description": "Integrate automatic geolocation: when the loaded local-first profile has no `location`, invoke the new geolocation hook and persist the returned coordinates by calling the existing `updateProfile` / `saveProfile` mechanism; ensure UI state updates without breaking if geolocation is unsupported/denied."
        },
        {
          "path": "frontend/src/utils/profileStorage.ts",
          "operation": "modify",
          "description": "If needed for robustness, extend local-first profile persistence helpers to support any additional non-nullable fields used by the auto-geolocation flow (while keeping `location` as the display field) and ensure save/load remains backward-compatible with existing stored profiles."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Introduce a reusable glassmorphic card style and apply it to existing solid-white card containers (excluding buttons), including MomentsImageCard and Home empty-state card.",
      "acceptanceCriteria": [
        "Cards that previously used a flat white background now render with a glassmorphic look (semi-transparent fill, backdrop blur, subtle border/highlight, soft shadow) on top of the beige app background.",
        "Buttons retain their existing styling (e.g., `.yellow-button`, `.yellow-button-small`, `.yellow-button-footer`) and are not converted to glassmorphic styling.",
        "The Moments image card and the Home “No moments captured yet” empty-state card both visibly reflect the glassmorphic style."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a reusable glassmorphic card utility/class (e.g., `.glass-card`) that provides semi-transparent background, backdrop blur, subtle border/highlight, and soft shadow suitable for the beige app background; do not alter existing button classes."
        },
        {
          "path": "frontend/src/components/MomentsImageCard.tsx",
          "operation": "modify",
          "description": "Update the outer card container that currently uses a solid white background to use the new reusable glassmorphic card class, keeping existing button/engagement controls unchanged."
        },
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Update the Home empty-state card container (shown when there is no most recent moment) to use the new reusable glassmorphic card class instead of a flat white background, without changing any button styling."
        }
      ]
    }
  ]
}