{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Home planning UI: saved planning cards, CTA '+' after first save, and weekly pill color fill",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "After saving a planned moment from the bottom sheet, render a new saved-planning card below the planning area showing date label, time, and optional title, with the plan color as full background fill.",
      "acceptanceCriteria": [
        "Saving a planned moment causes a new card to appear below the planning area without requiring navigation or reload",
        "Each card displays: date label + time + (optional) title",
        "Each card uses the planned moment color as a full card background (not just an accent/stripe)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PlannedMomentCard.tsx",
          "operation": "create",
          "description": "Create a dedicated saved-planning card component that renders planned moment details (date label, time, optional title) and applies the moment color as a full card background fill with readable text styling."
        },
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Render saved planning card(s) directly below the planning area after a successful Save by mapping planned moments to the new PlannedMomentCard component, ensuring the optional title row is omitted when not provided."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust Home saved-planning card styles as needed (spacing, rounded corners, typography) while keeping the moment color as the full card background fill."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Show multiple saved planning cards in a vertical list under the planning area and sort them most-recent-first.",
      "acceptanceCriteria": [
        "If 2+ planned moments exist, the Home screen shows a stacked list of planning cards",
        "The top card corresponds to the most recently created planned moment"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/plannedMomentsStorage.ts",
          "operation": "modify",
          "description": "Add a read helper that returns all planned moments sorted most-recent-first (by createdAt descending) to support Home’s vertical list rendering."
        },
        {
          "path": "frontend/src/hooks/usePlannedMoments.ts",
          "operation": "modify",
          "description": "Expose an all-moments collection for Home that refreshes on the existing storage-change subscription and uses the most-recent-first ordering provided by planned moments storage."
        },
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Update Home to render a vertical list of saved planning cards using the sorted all-moments data, ensuring newest saved appears at the top."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Change Home planning CTA: show 'Start Planning' when there are no planned moments; after first save replace it with a compact '+' icon button that opens the same planning bottom sheet.",
      "acceptanceCriteria": [
        "With zero planned moments, the Home screen shows the \"Start Planning\" CTA",
        "After saving the first planned moment, the \"Start Planning\" CTA is replaced by a compact '+' icon button",
        "Tapping the '+' opens the same Plan a Moment bottom sheet used previously"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomeScreen.tsx",
          "operation": "modify",
          "description": "Conditionally render the planning CTA based on whether any planned moments exist: show the existing 'Start Planning' button for zero moments, otherwise render a compact '+' icon button positioned for adding more plans; keep both CTAs wired to the same bottom sheet open flow."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add styling for the compact '+' icon button in the Home planning area (camera-circle style, compact size, consistent borders/shadows) and ensure layout accommodates it without introducing new routes."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Fix Home weekly calendar strip planned-moment color coding so the entire day pill is color-coded (not only a dot), updating immediately after saving a plan.",
      "acceptanceCriteria": [
        "After saving a planned moment for a date, that date’s day pill in the Home weekly strip visually reflects the plan color (pill is color-coded, not only a dot)",
        "The change appears immediately after Save (same session, no reload needed)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HomeWeeklyCalendarStrip.tsx",
          "operation": "modify",
          "description": "Update the day rendering logic so dates with planned moments apply the plan color to the full day pill background (including when selected), rather than only showing a dot indicator, while preserving selected/active affordances."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust/extend Home weekly strip styles to support a color-filled pill state (e.g., text color contrast, hover/active behavior, shadows) for dates that have planned moments."
        }
      ]
    }
  ]
}